app/controllers/tradelines_controller.rb

  def index
    tradelines = Tradeline.all
---
SELECT "tradelines".* FROM "tradelines"

  def show
    tradeline = Tradeline.find(params[:id])
---
SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]